fio_test/wuliji_randrw_ext4_largefiles
wuliji_randrw_ext4_largefiles: (g=0): rw=randrw, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=io_uring, iodepth=64
...
fio-3.28
Starting 16 processes
wuliji_randrw_ext4_largefiles: Laying out IO files (5 files / total 10240MiB)
wuliji_randrw_ext4_largefiles: Laying out IO files (5 files / total 10240MiB)
wuliji_randrw_ext4_largefiles: Laying out IO files (5 files / total 10240MiB)
[...]

wuliji_randrw_ext4_largefiles: (groupid=0, jobs=16): err= 0: pid=15928: Sat Aug 16 01:31:26 2025
  read: IOPS=310, BW=311MiB/s (326MB/s)(36.8GiB/121119msec)
    slat (usec): min=31, max=3145.2k, avg=3972.31, stdev=82680.64
    clat (usec): min=8, max=8398.4k, avg=2290619.22, stdev=1960255.41
     lat (msec): min=14, max=8398, avg=2294.59, stdev=1960.29
    clat percentiles (msec):
     |  1.00th=[   75],  5.00th=[  174], 10.00th=[  271], 20.00th=[  464],
     | 30.00th=[  709], 40.00th=[ 1053], 50.00th=[ 1737], 60.00th=[ 2735],
     | 70.00th=[ 3306], 80.00th=[ 3910], 90.00th=[ 5000], 95.00th=[ 6208],
     | 99.00th=[ 7819], 99.50th=[ 8087], 99.90th=[ 8221], 99.95th=[ 8288],
     | 99.99th=[ 8423]
   bw (  KiB/s): min=32693, max=2576353, per=100.00%, avg=581982.05, stdev=34015.37, samples=2072
   iops        : min=   17, max= 2514, avg=565.91, stdev=33.25, samples=2072
  write: IOPS=134, BW=135MiB/s (141MB/s)(16.0GiB/121119msec); 0 zone resets
    slat (usec): min=53, max=3167.5k, avg=13097.75, stdev=156606.17
    clat (msec): min=15, max=8396, avg=2279.25, stdev=1956.81
     lat (msec): min=15, max=8396, avg=2292.35, stdev=1953.98
    clat percentiles (msec):
     |  1.00th=[   74],  5.00th=[  171], 10.00th=[  268], 20.00th=[  451],
     | 30.00th=[  701], 40.00th=[ 1053], 50.00th=[ 1720], 60.00th=[ 2702],
     | 70.00th=[ 3306], 80.00th=[ 3910], 90.00th=[ 5000], 95.00th=[ 6141],
     | 99.00th=[ 7684], 99.50th=[ 8020], 99.90th=[ 8288], 99.95th=[ 8356],
     | 99.99th=[ 8423]
   bw (  KiB/s): min=32703, max=1231379, per=100.00%, avg=272057.37, stdev=15495.16, samples=1923
   iops        : min=   19, max= 1201, avg=263.29, stdev=15.16, samples=1923
  lat (usec)   : 10=0.01%, 20=0.01%, 1000=0.01%
  lat (msec)   : 4=0.01%, 10=0.02%, 20=0.10%, 50=0.40%, 100=1.18%
  lat (msec)   : 250=7.24%, 500=13.55%, 750=8.90%, 1000=7.26%, 2000=14.33%
  lat (msec)   : >=2000=47.01%
  cpu          : usr=0.11%, sys=0.67%, ctx=40385, majf=0, minf=298
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=0.5%, 32=0.9%, >=64=98.1%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=37666,16336,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=311MiB/s (326MB/s), 311MiB/s-311MiB/s (326MB/s-326MB/s), io=36.8GiB (39.5GB), run=121119-121119msec
  WRITE: bw=135MiB/s (141MB/s), 135MiB/s-135MiB/s (141MB/s-141MB/s), io=16.0GiB (17.1GB), run=121119-121119msec

Disk stats (read/write):
  nvme0n1: ios=75914/33011, merge=1/169, ticks=160261670/69328471, in_queue=229605241, util=99.90%