fio_test/wuliji_randrw_ext4_smallfiles
wuliji_randrw_ext4_smallfiles: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=io_uring, iodepth=256
...
fio-3.28
Starting 16 processes
wuliji_randrw_ext4_smallfiles: Laying out IO files (50 files / total 25MiB)
wuliji_randrw_ext4_smallfiles: Laying out IO files (50 files / total 25MiB)
wuliji_randrw_ext4_smallfiles: Laying out IO files (50 files / total 25MiB)
[...]

wuliji_randrw_ext4_smallfiles: (groupid=0, jobs=16): err= 0: pid=15795: Sat Aug 16 01:16:18 2025
  read: IOPS=11.9k, BW=46.6MiB/s (48.8MB/s)(2804MiB/60227msec)
    slat (nsec): min=1020, max=230523k, avg=271711.98, stdev=2546531.60
    clat (usec): min=976, max=672219, avg=240063.03, stdev=116486.34
     lat (msec): min=2, max=672, avg=240.33, stdev=116.71
    clat percentiles (msec):
     |  1.00th=[   22],  5.00th=[   43], 10.00th=[   71], 20.00th=[  113],
     | 30.00th=[  171], 40.00th=[  215], 50.00th=[  262], 60.00th=[  296],
     | 70.00th=[  321], 80.00th=[  347], 90.00th=[  376], 95.00th=[  401],
     | 99.00th=[  472], 99.50th=[  510], 99.90th=[  567], 99.95th=[  575],
     | 99.99th=[  609]
   bw (  KiB/s): min=23696, max=140696, per=99.98%, avg=47667.85, stdev=1344.65, samples=1920
   iops        : min= 5924, max=35174, avg=11916.92, stdev=336.16, samples=1920
  write: IOPS=5112, BW=20.0MiB/s (20.9MB/s)(1203MiB/60227msec); 0 zone resets
    slat (nsec): min=1284, max=227779k, avg=310775.20, stdev=3591801.74
    clat (msec): min=2, max=672, avg=240.10, stdev=116.69
     lat (msec): min=2, max=672, avg=240.41, stdev=116.88
    clat percentiles (msec):
     |  1.00th=[   22],  5.00th=[   43], 10.00th=[   71], 20.00th=[  112],
     | 30.00th=[  171], 40.00th=[  215], 50.00th=[  262], 60.00th=[  296],
     | 70.00th=[  321], 80.00th=[  347], 90.00th=[  376], 95.00th=[  401],
     | 99.00th=[  472], 99.50th=[  510], 99.90th=[  567], 99.95th=[  584],
     | 99.99th=[  609]
   bw (  KiB/s): min= 9336, max=60040, per=99.98%, avg=20444.03, stdev=578.44, samples=1920
   iops        : min= 2334, max=15010, avg=5110.96, stdev=144.61, samples=1920
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.03%, 20=0.65%, 50=5.94%
  lat (msec)   : 100=10.87%, 250=30.16%, 500=51.75%, 750=0.58%
  cpu          : usr=0.34%, sys=1.34%, ctx=565164, majf=0, minf=335
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=717864,307882,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=46.6MiB/s (48.8MB/s), 46.6MiB/s-46.6MiB/s (48.8MB/s-48.8MB/s), io=2804MiB (2940MB), run=60227-60227msec
  WRITE: bw=20.0MiB/s (20.9MB/s), 20.0MiB/s-20.0MiB/s (20.9MB/s-20.9MB/s), io=1203MiB (1261MB), run=60227-60227msec

Disk stats (read/write):
  nvme0n1: ios=716116/307211, merge=7/688, ticks=161738568/69334779, in_queue=231073965, util=100.00%